app/controllers/pics_controller.rb

SELECT "pics".* FROM "pics" ORDER BY created_at DESC
---
  def index
    @pics = Pic.order('created_at DESC')

INSERT INTO "pics" ("title", "description", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pic = Pic.new(pic_params)
    if @pic.save